bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_clock.c
/**
 * @file hal_clock.c
 * @brief
 *
 * Copyright (c) 2021 Bouffalolab team
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 */

#include "bl702_glb.h"
#include "bl702_pwm.h"
#include "bl702_timer.h"
#include "hal_clock.h"

static uint32_t mtimer_get_clk_src_div(void)
{
    return ((SystemCoreClockGet() / (GLB_Get_BCLK_Div() + 1)) / 1000 / 1000 - 1);
}

static void peripheral_clock_gate_all()
{
    uint32_t tmpVal;
    tmpVal = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG1);
    // tmpVal &= (~(1 << BL_AHB_SLAVE1_GPIP));
    // tmpVal &= (~(1 << BL_AHB_SLAVE1_SEC_DBG));
    // tmpVal &= (~(1 << BL_AHB_SLAVE1_SEC));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_TZ1));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_TZ2));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_DMA));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_EMAC));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_UART0));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_UART1));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_SPI));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_I2C));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_PWM));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_TMR));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_IRR));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_CKS));
    tmpVal &= (~(1 << 24)); //QDEC0
    tmpVal &= (~(1 << 25)); //QDEC1
    tmpVal &= (~(1 << 26)); //QDEC2/I2S
    tmpVal &= (~(1 << 27)); //KYS
    tmpVal &= (~(1 << BL_AHB_SLAVE1_USB));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_CAM));
    tmpVal &= (~(1 << BL_AHB_SLAVE1_MJPEG));
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);
}

void system_clock_init(void)
{
    /*select root clock*/
    GLB_Set_System_CLK(XTAL_TYPE, BSP_ROOT_CLOCK_SOURCE);
#if BSP_ROOT_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_PLL_57P6M
    /* fix 57.6M */
    SystemCoreClockSet(57.6 * 1000 * 1000);
#endif
    /*set fclk/hclk and bclk clock*/
    GLB_Set_System_CLK_Div(BSP_FCLK_DIV, BSP_BCLK_DIV);
    /* Set MTimer the same frequency as SystemCoreClock */
    GLB_Set_MTimer_CLK(1, GLB_MTIMER_CLK_BCLK, mtimer_get_clk_src_div());
#ifdef BSP_AUDIO_PLL_CLOCK_SOURCE
    PDS_Set_Audio_PLL_Freq(BSP_AUDIO_PLL_CLOCK_SOURCE - ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ);
#endif
#if 1
    HBN_32K_Sel(HBN_32K_RC);
    HBN_Power_Off_Xtal_32K();
#else
    HBN_32K_Sel(HBN_32K_XTAL);
    HBN_Power_On_Xtal_32K();
#endif
    if ((XTAL_TYPE == INTERNAL_RC_32M) || (XTAL_TYPE == XTAL_NONE)) {
        HBN_Set_XCLK_CLK_Sel(HBN_XCLK_CLK_RC32M);
    } else {
        HBN_Set_XCLK_CLK_Sel(HBN_XCLK_CLK_XTAL);
    }
}

void system_mtimer_clock_init(void)
{
    GLB_Set_MTimer_CLK(1, GLB_MTIMER_CLK_BCLK, mtimer_get_clk_src_div());
}

void system_mtimer_clock_reinit(void)
{
    /* reinit clock to 10M */
    GLB_Set_MTimer_CLK(1, GLB_MTIMER_CLK_BCLK, 7);
}

void peripheral_clock_init(void)
{
    uint32_t tmpVal = 0;

    peripheral_clock_gate_all();

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG1);
#if defined(BSP_USING_UART0) || defined(BSP_USING_UART1)
#if defined(BSP_USING_UART0)
    tmpVal |= (1 << BL_AHB_SLAVE1_UART0);
#endif
#if defined(BSP_USING_UART1)
    tmpVal |= (1 << BL_AHB_SLAVE1_UART1);
#endif
#if BSP_UART_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_PLL_96M
    GLB_Set_UART_CLK(ENABLE, HBN_UART_CLK_96M, BSP_UART_CLOCK_DIV);
#elif BSP_UART_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
    GLB_Set_UART_CLK(ENABLE, HBN_UART_CLK_FCLK, BSP_UART_CLOCK_DIV);
#else
#error "please select correct uart clock source"
#endif
#endif

#if defined(BSP_USING_I2C0)
#if BSP_I2C_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK
    tmpVal |= (1 << BL_AHB_SLAVE1_I2C);
    GLB_Set_I2C_CLK(ENABLE, BSP_I2C_CLOCK_DIV);
#else
#error "please select correct i2c clock source"
#endif
#endif

#if defined(BSP_USING_SPI0)
#if BSP_SPI_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK
    tmpVal |= (1 << BL_AHB_SLAVE1_SPI);
    GLB_Set_SPI_CLK(ENABLE, BSP_SPI_CLOCK_DIV);
#else
#error "please select correct spi clock source"
#endif
#endif

#if defined(BSP_USING_TIMER0)
    tmpVal |= (1 << BL_AHB_SLAVE1_TMR);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);

#if BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
    /* Configure timer clock source */
    uint32_t tmp = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_CS_1, TIMER_CLKSRC_FCLK);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp);

    /* Configure timer clock division */
    tmp = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR2, BSP_TIMER0_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    /* Configure timer clock source */
    uint32_t tmp = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_CS_1, TIMER_CLKSRC_XTAL);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp);

    /* Configure timer clock division */
    tmp = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR2, BSP_TIMER0_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
    /* Configure timer clock source */
    uint32_t tmp = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_CS_1, TIMER_CLKSRC_32K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp);

    /* Configure timer clock division */
    tmp = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR2, BSP_TIMER0_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_1K_CLK
    /* Configure timer clock source */
    uint32_t tmp = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_CS_1, TIMER_CLKSRC_1K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp);

    /* Configure timer clock division */
    tmp = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR2, BSP_TIMER0_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp);
#else
#error "please select correct timer0 clock source"
#endif
#endif

#if defined(BSP_USING_TIMER1)
    tmpVal |= (1 << BL_AHB_SLAVE1_TMR);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);

#if BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
    /* Configure timer clock source */
    uint32_t tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_CS_2, TIMER_CLKSRC_FCLK);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp1);

    /* Configure timer clock division */
    tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_TCDR3, BSP_TIMER1_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    /* Configure timer clock source */
    uint32_t tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_CS_2, TIMER_CLKSRC_XTAL);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp1);

    /* Configure timer clock division */
    tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_TCDR3, BSP_TIMER1_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
    /* Configure timer clock source */
    uint32_t tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_CS_2, TIMER_CLKSRC_32K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp1);

    /* Configure timer clock division */
    tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR3, BSP_TIMER1_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_1K_CLK
    /* Configure timer clock source */
    uint32_t tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp1, TIMER_CS_2, TIMER_CLKSRC_1K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmp1);

    /* Configure timer clock division */
    tmp1 = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmp1 = BL_SET_REG_BITS_VAL(tmp, TIMER_TCDR3, BSP_TIMER1_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmp1);
#else
#error "please select correct timer1 clock source"
#endif
#endif

#if defined(BSP_USING_WDT)
    tmpVal |= (1 << BL_AHB_SLAVE1_TMR);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);

#if BSP_WDT_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
    /* Configure watchdog timer clock source */
    uint32_t tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_CS_WDT, TIMER_CLKSRC_FCLK);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpwdt);

    /* Configure watchdog timer clock division */
    tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_WCDR, BSP_WDT_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpwdt);
#elif BSP_WDT_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    /* Configure watchdog timer clock source */
    uint32_t tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_CS_WDT, TIMER_CLKSRC_XTAL);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpwdt);

    /* Configure watchdog timer clock division */
    tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_WCDR, BSP_WDT_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpwdt);
#elif BSP_WDT_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
    /* Configure watchdog timer clock source */
    uint32_t tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_CS_WDT, TIMER_CLKSRC_32K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpwdt);

    /* Configure watchdog timer clock division */
    tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_WCDR, BSP_WDT_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpwdt);
#elif BSP_WDT_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_1K_CLK
    /* Configure watchdog timer clock source */
    uint32_t tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_CS_WDT, TIMER_CLKSRC_1K);
    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpwdt);

    /* Configure watchdog timer clock division */
    tmpwdt = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
    tmpwdt = BL_SET_REG_BITS_VAL(tmpwdt, TIMER_WCDR, BSP_WDT_CLOCK_DIV);
    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpwdt);
#else
#error "please select correct watchdog timer clock source"
#endif
#endif

#if defined(BSP_USING_PWM_CH0) || defined(BSP_USING_PWM_CH1) || defined(BSP_USING_PWM_CH2) || defined(BSP_USING_PWM_CH3) || defined(BSP_USING_PWM_CH4)
    tmpVal |= (1 << BL_AHB_SLAVE1_PWM);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);

    uint32_t timeoutCnt = 160 * 1000;
    uint32_t tmp_pwm;
    uint32_t PWMx;
#if BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK

    for (int i = 0; i < 5; i++) {
        PWMx = PWM_BASE + PWM_CHANNEL_OFFSET + (i)*0x20;
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmp_pwm, PWM_STOP_EN));

        while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG), PWM_STS_TOP)) {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return;
            }
        }
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        tmp_pwm = BL_SET_REG_BITS_VAL(tmp_pwm, PWM_REG_CLK_SEL, PWM_CLK_32K);
        BL_WR_REG(PWMx, PWM_CONFIG, tmp_pwm);
        /* Config pwm division */
        BL_WR_REG(PWMx, PWM_CLKDIV, BSP_PWM_CLOCK_DIV);
    }
#elif BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK

    for (int i = 0; i < 5; i++) {
        PWMx = PWM_BASE + PWM_CHANNEL_OFFSET + (i)*0x20;
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmp_pwm, PWM_STOP_EN));

        while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG), PWM_STS_TOP)) {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return;
            }
        }
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        tmp_pwm = BL_SET_REG_BITS_VAL(tmp_pwm, PWM_REG_CLK_SEL, PWM_CLK_BCLK);
        BL_WR_REG(PWMx, PWM_CONFIG, tmp_pwm);
        /* Config pwm division */
        BL_WR_REG(PWMx, PWM_CLKDIV, BSP_PWM_CLOCK_DIV);
    }
#elif BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK

    for (int i = 0; i < 5; i++) {
        PWMx = PWM_BASE + PWM_CHANNEL_OFFSET + (i)*0x20;
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmp_pwm, PWM_STOP_EN));

        while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG), PWM_STS_TOP)) {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return;
            }
        }
        tmp_pwm = BL_RD_REG(PWMx, PWM_CONFIG);
        tmp_pwm = BL_SET_REG_BITS_VAL(tmp_pwm, PWM_REG_CLK_SEL, PWM_CLK_XCLK);
        BL_WR_REG(PWMx, PWM_CONFIG, tmp_pwm);
        /* Config pwm division */
        BL_WR_REG(PWMx, PWM_CLKDIV, BSP_PWM_CLOCK_DIV);
    }
#else
#error "please select correct pwm clock source"
#endif
#endif

#if defined(BSP_USING_IR)
    tmpVal |= (1 << BL_AHB_SLAVE1_IRR);
    GLB_Set_IR_CLK(ENABLE, 0, BSP_IR_CLOCK_DIV);
#endif

