bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_clock.c
#if defined(BSP_USING_I2S0)
    tmpVal |= (1 << BL_AHB_SLAVE1_I2S);
    GLB_Set_I2S_CLK(ENABLE, GLB_I2S_OUT_REF_CLK_NONE);
#endif

#if defined(BSP_USING_ADC0)
    //tmpVal |= (1 << BL_AHB_SLAVE1_GPIP);
#if BSP_ADC_CLOCK_SOURCE >= ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ
    GLB_Set_ADC_CLK(ENABLE, GLB_ADC_CLK_AUDIO_PLL, BSP_ADC_CLOCK_DIV);
#elif BSP_ADC_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    GLB_Set_ADC_CLK(ENABLE, GLB_ADC_CLK_XCLK, BSP_ADC_CLOCK_DIV);
#else
#error "please select correct adc clock source"
#endif
#endif

#if defined(BSP_USING_DAC0)
    //tmpVal |= (1 << BL_AHB_SLAVE1_GPIP);
#if BSP_DAC_CLOCK_SOURCE >= ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ
    GLB_Set_DAC_CLK(ENABLE, GLB_DAC_CLK_AUDIO_PLL, BSP_DAC_CLOCK_DIV);
#elif BSP_DAC_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    GLB_Set_DAC_CLK(ENABLE, GLB_DAC_CLK_XCLK, BSP_DAC_CLOCK_DIV);
#else
#error "please select correct dac clock source"
#endif
#endif

#if defined(BSP_USING_CAM)
    tmpVal |= (1 << BL_AHB_SLAVE1_CAM);
#if BSP_CAM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_PLL_96M
    GLB_Set_CAM_CLK(ENABLE, GLB_CAM_CLK_DLL96M, BSP_CAM_CLOCK_DIV);
    GLB_SWAP_EMAC_CAM_Pin(GLB_EMAC_CAM_PIN_CAM);
#elif BSP_CAM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    GLB_Set_CAM_CLK(ENABLE, GLB_CAM_CLK_XCLK, BSP_CAM_CLOCK_DIV);
    GLB_SWAP_EMAC_CAM_Pin(GLB_EMAC_CAM_PIN_CAM);
#else
#error "please select correct camera clock source"
#endif
#endif

#if defined(BSP_USING_QDEC0) || defined(BSP_USING_QDEC1) || defined(BSP_USING_QDEC2) || defined(BSP_USING_KEYSCAN)
#ifdef BSP_USING_KEYSCAN
    tmpVal |= (1 << 27);
#endif
#if defined(BSP_USING_QDEC0)
    tmpVal |= (1 << 24);
#endif
#if defined(BSP_USING_QDEC1)
    tmpVal |= (1 << 25);
#endif
#if defined(BSP_USING_QDEC2)
    tmpVal |= (1 << 26);
#endif
#if BSP_QDEC_KEYSCAN_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
    GLB_Set_QDEC_CLK(GLB_QDEC_CLK_F32K, BSP_QDEC_KEYSCAN_CLOCK_DIV);
#elif BSP_QDEC_KEYSCAN_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
    GLB_Set_QDEC_CLK(GLB_QDEC_CLK_XCLK, BSP_QDEC_KEYSCAN_CLOCK_DIV);
#else
#error "please select correct qdec or keyscan clock source"
#endif
#endif

#if defined(BSP_USING_USB)
    tmpVal |= (1 << BL_AHB_SLAVE1_USB);
    GLB_Set_USB_CLK(1);
#endif
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);
}
uint32_t system_clock_get(enum system_clock_type type)
{
    switch (type) {
        case SYSTEM_CLOCK_ROOT_CLOCK:
            if (GLB_Get_Root_CLK_Sel() == 0) {
                return 32 * 1000 * 1000;
            } else if (GLB_Get_Root_CLK_Sel() == 1)
                return 32 * 1000 * 1000;
            else {
                uint32_t tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
                tmpVal = BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_PLL_SEL);
                if (tmpVal == 0) {
                    return 57.6 * 1000 * 1000;
                } else if (tmpVal == 1) {
                    return 96 * 1000 * 1000;
                } else if (tmpVal == 2) {
                    return 144 * 1000 * 1000;
                } else {
                    return 0;
                }
            }
        case SYSTEM_CLOCK_FCLK:
            return system_clock_get(SYSTEM_CLOCK_ROOT_CLOCK) / (GLB_Get_HCLK_Div() + 1);

        case SYSTEM_CLOCK_BCLK:
            return system_clock_get(SYSTEM_CLOCK_ROOT_CLOCK) / (GLB_Get_HCLK_Div() + 1) / (GLB_Get_BCLK_Div() + 1);

        case SYSTEM_CLOCK_XCLK:
            return 32000000;
        case SYSTEM_CLOCK_32K_CLK:
            return 32000;
        case SYSTEM_CLOCK_AUPLL:
#ifdef BSP_AUDIO_PLL_CLOCK_SOURCE
            if (BSP_AUDIO_PLL_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ) {
                return 12288000;
            } else if (BSP_AUDIO_PLL_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_AUPLL_11289600_HZ) {
                return 11289600;
            } else if (BSP_AUDIO_PLL_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_AUPLL_5644800_HZ) {
                return 5644800;
            } else if (BSP_AUDIO_PLL_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_AUPLL_24576000_HZ) {
                return 24576000;
            } else if (BSP_AUDIO_PLL_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_AUPLL_24000000_HZ) {
                return 24000000;
            }
#endif
        default:
            break;
    }

    return 0;
}
uint32_t peripheral_clock_get(enum peripheral_clock_type type)
{
    uint32_t tmpVal;
    uint32_t div;

    switch (type) {
#if defined(BSP_USING_UART0) || defined(BSP_USING_UART1)
        case PERIPHERAL_CLOCK_UART:
#if BSP_UART_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_PLL_96M
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG2);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_UART_CLK_DIV);
            return 96000000 / (div + 1);
#elif BSP_UART_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG2);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_UART_CLK_DIV);
            return system_clock_get(SYSTEM_CLOCK_FCLK) / (div + 1);
#else
            break;
#endif

#endif
#if defined(BSP_USING_SPI0)
        case PERIPHERAL_CLOCK_SPI:
#if BSP_SPI_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG3);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_SPI_CLK_DIV);
            return system_clock_get(SYSTEM_CLOCK_BCLK) / (div + 1);
#else
            break;
#endif
#endif
#if defined(BSP_USING_I2C0)
        case PERIPHERAL_CLOCK_I2C:
#if BSP_I2C_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG3);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_I2C_CLK_DIV);
            return system_clock_get(SYSTEM_CLOCK_BCLK) / (div + 1);

#else
            break;
#endif
#endif
#if defined(BSP_USING_I2S0)
        case PERIPHERAL_CLOCK_I2S:
            return system_clock_get(SYSTEM_CLOCK_AUPLL);
#endif
#if defined(BSP_USING_ADC0)
        case PERIPHERAL_CLOCK_ADC:
#if BSP_ADC_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_GPADC_32M_SRC_CTRL);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_GPADC_32M_CLK_DIV);
            return system_clock_get(SYSTEM_CLOCK_XCLK) / div;
#elif BSP_ADC_CLOCK_SOURCE >= ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ
            tmpVal = BL_RD_REG(GLB_BASE, GLB_GPADC_32M_SRC_CTRL);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_GPADC_32M_CLK_DIV);
            return system_clock_get(SYSTEM_CLOCK_AUPLL) / div;
#else
            break;
#endif
#endif
#if defined(BSP_USING_DAC0)
        case PERIPHERAL_CLOCK_DAC:
#if BSP_DAC_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG32K_WAKEUP_CTRL);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_DIG_512K_DIV);
            return system_clock_get(SYSTEM_CLOCK_XCLK) / (div + 1);
#elif BSP_DAC_CLOCK_SOURCE >= ROOT_CLOCK_SOURCE_AUPLL_12288000_HZ
            tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG32K_WAKEUP_CTRL);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_DIG_512K_DIV);
            return system_clock_get(SYSTEM_CLOCK_AUPLL) / div;
#else
            break;
#endif
#endif
#if defined(BSP_USING_TIMER0)
        case PERIPHERAL_CLOCK_TIMER0:
#if BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR2);
            return system_clock_get(SYSTEM_CLOCK_FCLK) / (div + 1);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR2);
            return system_clock_get(SYSTEM_CLOCK_XCLK) / (div + 1);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR2);
            return system_clock_get(SYSTEM_CLOCK_32K_CLK) / (div + 1);
#elif BSP_TIMER0_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_1K_CLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR2);
            return 1000 / (div + 1);
#else
            break;
#endif
#endif
#if defined(BSP_USING_TIMER1)
        case PERIPHERAL_CLOCK_TIMER1:
#if BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_FCLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR3);
            return system_clock_get(SYSTEM_CLOCK_FCLK) / (div + 1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR3);
            return system_clock_get(SYSTEM_CLOCK_XCLK) / (div + 1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR3);
            return system_clock_get(SYSTEM_CLOCK_32K_CLK) / (div + 1);
#elif BSP_TIMER1_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_1K_CLK
            tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
            div = BL_GET_REG_BITS_VAL(tmpVal, TIMER_TCDR3);
            return 1000 / (div + 1);
#else
            break;
#endif
#endif
#if defined(BSP_USING_PWM_CH0) || defined(BSP_USING_PWM_CH1) || defined(BSP_USING_PWM_CH2) || defined(BSP_USING_PWM_CH3) || defined(BSP_USING_PWM_CH4)
        case PERIPHERAL_CLOCK_PWM:
#if BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_32K_CLK
            div = BL_RD_REG(PWM_BASE + PWM_CHANNEL_OFFSET, PWM_CLKDIV);
            return system_clock_get(SYSTEM_CLOCK_32K_CLK) / div;
#elif BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_BCLK
            div = BL_RD_REG(PWM_BASE + PWM_CHANNEL_OFFSET, PWM_CLKDIV);
            return system_clock_get(SYSTEM_CLOCK_BCLK) / div;
#elif BSP_PWM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            div = BL_RD_REG(PWM_BASE + PWM_CHANNEL_OFFSET, PWM_CLKDIV);
            return system_clock_get(SYSTEM_CLOCK_XCLK) / div;
#else
            break;
#endif
#endif
#if defined(BSP_USING_CAM)
        case PERIPHERAL_CLOCK_CAM:
#if BSP_CAM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_PLL_96M
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG1);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_CAM_REF_CLK_DIV);
            return (96000000 / (div + 1));
#elif BSP_CAM_CLOCK_SOURCE == ROOT_CLOCK_SOURCE_XCLK
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG1);
            div = BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_CAM_REF_CLK_DIV);
            return (system_clock_get(SYSTEM_CLOCK_XCLK) / (div + 1));
#else
            break;
#endif
#endif
        default:

            break;
    }

    (void)(tmpVal);
    (void)(div);
    return 0;
}